In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import datetime

In [2]:
campaign_master = pd.read_csv("campaign_master.csv")
class_master = pd.read_csv("class_master.csv")
customer_master = pd.read_csv("customer_master.csv")
use_log = pd.read_csv("use_log.csv")

In [3]:
campaign_master.head()

  campaign_id campaign_name
0         CA1            通常
1         CA2         入会費半額
2         CA3         入会費無料

In [4]:
class_master.head()

  class class_name  price
0   C01     オールタイム  10500
1   C02      デイタイム   7500
2   C03        ナイト   6000

In [5]:
customer_master.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

In [6]:
len(customer_master)

4192

In [7]:
use_log.head()

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

In [8]:
len(use_log)

197428

customer_master, class_master, campaign_masterをつなげる

In [9]:
#はじめにcustomer_masterとclass_masterをつなげる

united1 = pd.merge(customer_master, class_master, on = "class")
united1

#次にcampaign_masterをつなげる

united2 = pd.merge(united1, campaign_master, on = "campaign_id")
united2

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
4,IK271057,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,オールタイム,10500,通常
...,...,...,...,...,...,...,...,...,...,...,...
4187,IK562610,XXXXX,C02,F,2018-12-13 00:00:00,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4188,HI599354,XXXX,C02,M,2018-12-13 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料
4189,GD796859,XX,C02,F,2018-12-14 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料
4190,GD082270,XXXX,C02,F,2018-12-14 00:00:00,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4191,OA426023,XXXX,C02,F,2018-12-14 00:00:00,NaN,CA3,0,デイタイム,7500,入会費無料

In [10]:
# 結合の前後で行数が変わらない事を確認

print(len(customer_master))
print(len(united2))

4192
4192

In [11]:
# 欠損値の確認

united2.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

# ここから自身の解答

会員区分、キャンペーン区分、性別、退会済毎の人数を集計する

In [12]:
#会員区分毎の数を集計

united2["class_name"].value_counts()

オールタイム    2045
ナイト       1128
デイタイム     1019
Name: class_name, dtype: int64

In [13]:
#キャンペーン区分毎の数を集計

united2["campaign_name"].value_counts()

通常       3050
入会費半額     650
入会費無料     492
Name: campaign_name, dtype: int64

In [14]:
#性別毎の数を集計

united2["gender"].value_counts()

M    2209
F    1983
Name: gender, dtype: int64

In [15]:
#退会済の数を集計

united2["is_deleted"].value_counts()

0    2842
1    1350
Name: is_deleted, dtype: int64

次に、2018年4月1日から2019年3月31日までに入会(スタート)した人の数を調べる

In [16]:
#start_dateのデータ型を調べる

united2["start_date"]

0       2015-05-01 00:00:00
1       2015-05-01 00:00:00
2       2015-05-01 00:00:00
3       2015-05-01 00:00:00
4       2015-05-01 00:00:00
               ...
4187    2018-12-13 00:00:00
4188    2018-12-13 00:00:00
4189    2018-12-14 00:00:00
4190    2018-12-14 00:00:00
4191    2018-12-14 00:00:00
Name: start_date, Length: 4192, dtype: object

In [17]:
#objectというのが分かったので、日付型に変換する

united2["start_date"] = pd.to_datetime(united2["start_date"])
united2["start_date"]

0      2015-05-01
1      2015-05-01
2      2015-05-01
3      2015-05-01
4      2015-05-01
          ...
4187   2018-12-13
4188   2018-12-13
4189   2018-12-14
4190   2018-12-14
4191   2018-12-14
Name: start_date, Length: 4192, dtype: datetime64[ns]

In [21]:
united2

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
1,PL270116,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
2,OA974876,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
3,HD024127,XXXXX,C01,F,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
4,IK271057,XXXXX,C01,M,2015-05-01,NaN,CA1,0,オールタイム,10500,通常
...,...,...,...,...,...,...,...,...,...,...,...
4187,IK562610,XXXXX,C02,F,2018-12-13,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4188,HI599354,XXXX,C02,M,2018-12-13,NaN,CA3,0,デイタイム,7500,入会費無料
4189,GD796859,XX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料
4190,GD082270,XXXX,C02,F,2018-12-14,2019-02-28 00:00:00,CA3,1,デイタイム,7500,入会費無料
4191,OA426023,XXXX,C02,F,2018-12-14,NaN,CA3,0,デイタイム,7500,入会費無料

In [22]:
#最も最近の入会日を調べる

united2["start_date"].max()

Timestamp('2019-03-15 00:00:00')

In [28]:
united2["start_date"].sort_values()

0      2015-05-01
2308   2015-05-01
2309   2015-05-01
2310   2015-05-01
2311   2015-05-01
          ...
1465   2019-03-14
2305   2019-03-14
1464   2019-03-14
1466   2019-03-14
3049   2019-03-15
Name: start_date, Length: 4192, dtype: datetime64[ns]

In [50]:
#2018-4-1以降に入会した人の人数を調べる

len(united2.loc[united2["start_date"] >= "2018-4-1",["start_date"]])

1376

模範解答は1361人のため、若干数字に誤差が生じている

2018年4月以降に入会し、一年以内にやめている人の数を調べる

In [45]:
len(united2.loc[(united2["start_date"] >= "2018-4-1") & (united2["is_deleted"] == 1),:])

659

これだと数が合わないため、「スタートしたがすでにやめている人を含まない」という訳では無さそう  
その後も試行錯誤したが、どうして誤差が生じるのかは分からなかった

※その後模範解答を見た所、解答では2018年4月1日の入会人数を含めていないのが原因というのが分かった